OpenFOAM-5.x/tutorials/multiphase/interFoam/RAS/damBreakPorousBaffle/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

p_rgh
{
    boundaryField
    {
        porous_half0
        {
            type            porousBafflePressure;
            patchType       cyclic;
            D               700;
            I               500;
            length          1.05;
            jump            uniform 0;
            value           uniform 0;
        }
        porous_half1
        {
            type            porousBafflePressure;
            patchType       cyclic;
            D               700;
            I               500;
            length          1.05;
            jump            uniform 0;
            value           uniform 0;
        }
    }
}

// ************************************************************************* //
